{"class_name": "Model", "config": {"name": "rnpa", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_12"}, "name": "input_12", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv0", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.004999999888241291}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv0", "inbound_nodes": [[["input_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn0", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn0", "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu0", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu0", "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv1a", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.004999999888241291}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1a", "inbound_nodes": [[["relu0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn1b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn1b", "inbound_nodes": [[["conv1a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu1b", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu1b", "inbound_nodes": [[["bn1b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv1b", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.004999999888241291}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1b", "inbound_nodes": [[["relu1b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn1c", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn1c", "inbound_nodes": [[["conv1b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu1c", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu1c", "inbound_nodes": [[["bn1c", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv1c", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.004999999888241291}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1c", "inbound_nodes": [[["relu1c", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "merge1", "trainable": true, "dtype": "float32"}, "name": "merge1", "inbound_nodes": [[["conv1c", 0, 0, {}], ["relu0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn2a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn2a", "inbound_nodes": [[["merge1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu2a", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu2a", "inbound_nodes": [[["bn2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2a", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.004999999888241291}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2a", "inbound_nodes": [[["relu2a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn2b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn2b", "inbound_nodes": [[["conv2a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu2b", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu2b", "inbound_nodes": [[["bn2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2b", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.004999999888241291}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2b", "inbound_nodes": [[["relu2b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn2c", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn2c", "inbound_nodes": [[["conv2b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu2c", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu2c", "inbound_nodes": [[["bn2c", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2c", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.004999999888241291}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2c", "inbound_nodes": [[["relu2c", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "merge2", "trainable": true, "dtype": "float32"}, "name": "merge2", "inbound_nodes": [[["conv2c", 0, 0, {}], ["merge1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn3a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn3a", "inbound_nodes": [[["merge2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu3a", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu3a", "inbound_nodes": [[["bn3a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3a", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.004999999888241291}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3a", "inbound_nodes": [[["relu3a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn3b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn3b", "inbound_nodes": [[["conv3a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu3b", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu3b", "inbound_nodes": [[["bn3b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3b", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.004999999888241291}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3b", "inbound_nodes": [[["relu3b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn3c", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn3c", "inbound_nodes": [[["conv3b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu3c", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu3c", "inbound_nodes": [[["bn3c", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3c", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.004999999888241291}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3c", "inbound_nodes": [[["relu3c", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "merge3", "trainable": true, "dtype": "float32"}, "name": "merge3", "inbound_nodes": [[["conv3c", 0, 0, {}], ["merge2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn4a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn4a", "inbound_nodes": [[["merge3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu4a", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu4a", "inbound_nodes": [[["bn4a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4a", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.004999999888241291}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4a", "inbound_nodes": [[["relu4a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn4b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn4b", "inbound_nodes": [[["conv4a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu4b", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu4b", "inbound_nodes": [[["bn4b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4b", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.004999999888241291}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4b", "inbound_nodes": [[["relu4b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn4c", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn4c", "inbound_nodes": [[["conv4b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu4c", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu4c", "inbound_nodes": [[["bn4c", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4c", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.004999999888241291}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4c", "inbound_nodes": [[["relu4c", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "merge4", "trainable": true, "dtype": "float32"}, "name": "merge4", "inbound_nodes": [[["conv4c", 0, 0, {}], ["merge3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn5a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn5a", "inbound_nodes": [[["merge4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu5a", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu5a", "inbound_nodes": [[["bn5a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv5a", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.004999999888241291}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv5a", "inbound_nodes": [[["relu5a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn5b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn5b", "inbound_nodes": [[["conv5a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu5b", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu5b", "inbound_nodes": [[["bn5b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv5b", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.004999999888241291}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv5b", "inbound_nodes": [[["relu5b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn5c", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn5c", "inbound_nodes": [[["conv5b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu5c", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu5c", "inbound_nodes": [[["bn5c", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv5c", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.004999999888241291}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv5c", "inbound_nodes": [[["relu5c", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "merge5", "trainable": true, "dtype": "float32"}, "name": "merge5", "inbound_nodes": [[["conv5c", 0, 0, {}], ["merge4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bnF", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bnF", "inbound_nodes": [[["merge5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "reluF", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "reluF", "inbound_nodes": [[["bnF", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "avg_pool", "trainable": true, "dtype": "float32", "pool_size": [16.0, 16.0], "padding": "valid", "strides": [16.0, 16.0], "data_format": "channels_last"}, "name": "avg_pool", "inbound_nodes": [[["reluF", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flat", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flat", "inbound_nodes": [[["avg_pool", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "fc10", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fc10", "inbound_nodes": [[["flat", 0, 0, {}]]]}], "input_layers": [["input_12", 0, 0]], "output_layers": [["fc10", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}